[
    {
        "Erosion and Sediment Control": [
            {
                "Silt Fence": [
                    {
                        "Comment": "Provide silt fence around the extents of disturbance.", 
                        "rownum": "row1", 
                        "Reference": "(VESCH 7.12)", 
                        "Criteria": "Silt fence must be provided around the extends of construction and/or disturbance."
                    }, 
                    {
                        "Comment": "Provide the silt fence detail, it is missing from the plans. ", 
                        "rownum": "row2", 
                        "Reference": "(VESCH 8.9)", 
                        "Criteria": "The silt fence detail must be provided on the plans."
                    }
                ]
            }
        ], 
        "Stormwater": [
            {
                "Permeable Pavement": [
                    {
                        "Comment": "The system is showing that there is less than 2' in separation between the bottom of facility and the SHGWT. Revise the desing to provide the separation. ", 
                        "rownum": "row3", 
                        "Reference": "(DEQ Spec. No. 7.)", 
                        "Criteria": "A 2’ separation must be established between the bottom layer of the permeable pavement and the seasonal high ground water table (SHGWT.)"
                    }, 
                    {
                        "Comment": "The shown permeable pavement system is setback less than 5' from the adjacent building. Relocate the system away from the building to meet the required setback. ", 
                        "rownum": "row4", 
                        "Reference": "(DEQ Spec. No. 7. Table 7.4)", 
                        "Criteria": "A 5’ setback must be provided between the facility and any building. "
                    }
                ]
            }, 
            {
                "Stormwater - General Requirements": [
                    {
                        "Comment": "Provide a Stormwater Management Narrative with the following information, but not be limited to: Description of existing site conditions; Pre-development and post-development drainage conditions and patterns; Disturbed area; Proposed impervious area; Soil characteristics; Description of proposed development; Description of proposed stormwater management facilities; Special circumstances and assumptions; Summary of flow results and how the stormwater management design meets water quality and water quantity (channel and flood protection) requirements in accordance with the City Stormwater Management Ordinance", 
                        "rownum": "row5", 
                        "Reference": "(City Code, Appendix D, Sec. 1-6.)", 
                        "Criteria": "A stormwater management narrative must be included for every stormwater management plan. "
                    }, 
                    {
                        "Comment": "Provide the predeveloped and post developed drainage area maps to the plans", 
                        "rownum": "row6", 
                        "Reference": "(City Code, Appendix D, Sec. 1-6.)", 
                        "Criteria": "Drainage area maps must be provided that correctly reflect the drainage characteristics of the predeveloped and post-developed conditions"
                    }
                ]
            }
        ], 
        "General": [
            {
                "Site Plan - General Requirements": [
                    {
                        "Comment": "Provide a title to the site plan. ", 
                        "rownum": "row7", 
                        "Reference": "Guide to Commercial Site Plan Development", 
                        "Criteria": "The site plan should have a title."
                    }, 
                    {
                        "Comment": "Please correct the scale, it does not match the site plan. ", 
                        "rownum": "row8", 
                        "Reference": "Guide to Commercial Site Plan Development", 
                        "Criteria": "All layout sheets must have a scale."
                    }
                ]
            }
        ]
    }
]